Revit 2024 API
StairsComponentConnection.ElementId Property
 The element Id of connected stairs component in the stairs connection.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId ElementId { get; }
Visual Basic
Public ReadOnly Property ElementId As ElementId
	Get
Visual C++
public:
property ElementId^ ElementId {
	ElementId^ get ();
}
See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace